---
kind: property
id: P:Autodesk.Revit.UI.ExternalCommandData.Application
source: html/4ac271da-80b2-d66e-3824-fa88091c1e79.htm
---
# Autodesk.Revit.UI.ExternalCommandData.Application Property

Retrieves an object that represents the current Application for
external command.

## Syntax (C#)
```csharp
public UIApplication Application { get; set; }
```